{
  "getCV": "My CV",
  "intro": "Hello, I am passionate about software and web design, and I love creating tools that make people’s lives easier. I am developer with a strong eye for design and over 20 years of experience in crafting innovative digital solutions. My expertise spans frontend and full-stack development, with a focus on creating responsive, high-performance user interfaces.",
  "work-experience": "Work Experiences",
  "present": "Present",
  "read-more": "More details",
  "deltatre-jobtitle": "Full Stack Developer - IT services for Sport Innovations",
  "deltatre-jobdesc": "Development and maintenance of Events management solutions for UEFA, major European football leagues, and other international sport websites.",
  "ynap-jobtitle": "Tech Leader - Frontend Web Developer for Luxury Online Flagship Stores",
  "ynap-jobdesc": "Development and maintenance of dunhill.com and maison-alaia.com e-commerce. Development of web responsive and cross-browser User Interfaces and improve web performance in partnership with Google.",
  "euris-jobtitle": "Frontend Web Developer for Luxury Online Flagship Stores",
  "euris-jobdesc": "Development and maintenance of chloe.com, lanvin.com and dunhill.com e-commerce. Development of web responsive and cross-browser.",
  "mw-jobtitle": "Freelance Web Developer",
  "mw-jobdesc": "Development and maintenance of web sites and web portals. Development with CMS like Wordpress and Joomla and other custom features and application in PHP and Javascript. SEO on-site optimizations, Web Marketing and Social Marketing. Hosting setup and maintenances.",
  "cedac-jobtitle": "Java Junior Developer",
  "cedac-jobdesc": "Development in Java, XML, XSL, HTML, CSS and Javascript for Home Banking CBI applications.",
  "demsoft-jobtitle": "UX Developer and Game Designer",
  "demsoft-jobdesc": "Videogame design and development of PC Basket 2002 and PC Basket 2003",
  "brands": "Brands",
  "brands-intro": "The major brands I have collaborated with",
  "skills": "Tech Skills",
  "skills-intro": "A full stack developer must master a wide range of technologies and tools to seamlessly integrate front-end and back-end functionalities, ensuring efficient and robust solutions. This broad expertise also allows them to adapt quickly to evolving project requirements and effectively troubleshoot complex issues.",
  "frontend-base": "Frontend",
  "frontend-base-description": "The basic technologies for frontend development web pages and web applications.",
  "html5-description": "The standard markup language for creating web pages and web applications.",
  "css-3-description": "The style sheet language used for describing the presentation of a document written in HTML.",
  "chrome-devtools-description": "A set of web developer tools built directly into the Google Chrome browser. These tools allow developers to inspect, debug, and optimize the performance of web applications.",
  "responsive-design-description": "A design approach ensuring web pages render properly on a variety of devices and screen sizes.",
  "pixel-perfect-description": "A methodology focusing on precise alignment of every element so the final layout exactly matches the intended mockup.",
  "w3c-description": "Standards and guidelines from the World Wide Web Consortium to ensure accessibility, consistency, and compatibility across the web.",
  "http-description": "The foundational protocol for data exchange on the web, enabling communication between clients and servers.",
  "web-dev-description": "A platform by Google providing guidance, metrics, and best practices for building fast, secure, and user-centric websites.",
  "bootstrap-description": "A front-end toolkit offering responsive layout, prebuilt components, and theming options to streamline web development.",
  "sass-description": "A CSS preprocessor that adds features like variables, nesting, and mixins to simplify and organize styling.",
  "tailwind-css-description": "A utility-first CSS framework that provides ready-to-use classes, enabling rapid and consistent UI development.",
  "design-uxui": "Design & UX/UI",
  "design-uxui-description": "The principles and tools for creating engaging and user-friendly digital experiences.",
  "svg-xml-description": "A vector image format based on XML for scalable, high-quality graphics on the web.",
  "figma-description": "A collaborative interface design tool for real-time prototyping and teamwork.",
  "invision-description": "A digital product design platform offering prototyping, collaboration, and workflow management.",
  "illustrator-description": "A leading vector graphics software for creating illustrations, logos, and scalable visuals.",
  "photoshop-description": "A widely used raster graphics editor for digital art, image editing, and compositing.",
  "material-ui-description": "A component library implementing Google’s Material Design for a consistent UI.",
  "frontend-dev": "Frontend Development",
  "frontend-dev-description": "Focus on building dynamic user experiences, bridging design with code to create responsive interfaces.",
  "visual-studio-code-description": "A versatile code editor featuring built-in Git, debugging tools, and a rich extension ecosystem.",
  "javascript-js-description": "The foundational programming language of the web, enabling dynamic and interactive content in browsers.",
  "typescript-icon-description": "A typed superset of JavaScript that brings static type-checking and scalability to large codebases.",
  "jquery-plain-wordmark-description": "A library that simplifies DOM manipulation, event handling, and AJAX with cross-browser support.",
  "nodejs-description": "A server-side JavaScript runtime designed for fast, scalable network applications.",
  "npm-description": "Node.js's default package manager, offering a vast repository of libraries and development tools.",
  "yarn-original-wordmark-description": "A Node.js package manager focused on speed, security, and efficient dependency handling.",
  "file-type-angular-description": "A TypeScript-based framework for developing robust, modular, and maintainable single-page applications.",
  "react-description": "A popular library for building reusable UI components and managing state with a virtual DOM.",
  "redux-original-description": "A predictable state container that centralizes data flow, commonly used with React and Angular applications.",
  "file-type-jest-description": "A testing framework that simplifies unit, snapshot, and integration testing in JavaScript.",
  "google-maps-description": "An API that integrates interactive maps, geocoding, and location services into web applications.",
  "mapbox-description": "A mapping and location platform offering customizable styles, data visualization, and real-time updates.",
  "gulp-description": "A streaming task runner that automates repetitive build processes in front-end development.",
  "webpack-original-description": "A robust module bundler that compiles JavaScript, CSS, and more into optimized assets.",
  "electron-description": "A framework enabling cross-platform desktop apps using JavaScript, HTML, and CSS.",
  "cloudinary-description": "A media management service for hosting, transforming, and delivering images and videos.",
  "brand-threejs-description": "A 3D JavaScript library leveraging WebGL to create interactive, real-time 3D graphics in the browser.",
  "backend": "Backend",
  "backend-description": "The technologies and tools for server-side development and data management.",
  "visual-studio-description": "An integrated development environment by Microsoft for building, debugging, and deploying .NET applications.",
  "aspdotnet-description": "A framework for building modern, cloud-based, and internet-connected .NET apps.",
  "c-sharp-c-description": "A versatile, object-oriented language by Microsoft designed to create efficient .NET solutions.",
  "php-description": "A widely used server-side scripting language that powers dynamic websites and CMS platforms.",
  "python-description": "A high-level, general-purpose language known for its readability and vast ecosystem.",
  "gnome-fs-ftp-description": "A network protocol for transferring files between client and server in a standardized way.",
  "ssh-description": "A cryptographic protocol ensuring secure remote login and data exchange over insecure networks.",
  "file-type-rest-description": "A stateless architecture focused on performance and scalability for modern web services.",
  "swagger-description": "A toolset for documenting and testing RESTful APIs with interactive, human-readable interfaces.",
  "apache-original-wordmark-description": "A robust, open-source HTTP server known for its flexibility and wide adoption.",
  "file-type-firebase-description": "A Google-backed platform offering real-time databases, authentication, and hosting services.",
  "google-cloud-description": "A suite of cloud computing services for scalable storage, data processing, and app deployment.",
  "aws-description": "Amazon’s on-demand cloud platform providing compute, storage, databases, and more.",
  "sonarqube-description": "A continuous inspection tool that analyzes code quality, security, and maintainability.",
  "database": "Database",
  "database-description": "Focus on storing and managing data, ensuring consistency, security, and efficient queries.",
  "mysql-original-wordmark-description": "A popular open-source relational database known for its speed, reliability, and ease of use.",
  "postgresql-plain-wordmark-description": "An advanced open-source database offering strong data integrity and SQL compliance.",
  "file-type-access-description": "A Microsoft database tool for creating and managing data-driven desktop applications.",
  "firestore-description": "A flexible, scalable NoSQL database by Google Cloud for storing and syncing data across devices.",
  "mongodb-original-wordmark-description": "A NoSQL document database providing high scalability and flexibility.",
  "graphql-description": "A query language for APIs that enables precise data fetching, reducing over-fetching.",
  "xml-document-description": "A markup language to store and transport data in a structured, machine-readable format.",
  "application-xslt-xml-description": "A language for transforming XML documents into various formats, enabling dynamic content generation.",
  "cicd": "CI/CD and Project Management",
  "cicd-description": "Continuous integration and continuous deployment practices to automate testing, build, and deployment processes.",
  "github-description": "A widely-used platform for version control and collaboration, powered by Git.",
  "bitbucket-description": "A Git-based source code repository hosting service designed for teams and enterprises.",
  "microsoft-azure-description": "Microsoft’s cloud computing service, offering CI/CD pipelines, hosting, and DevOps tools.",
  "jenkins-original-description": "An open-source automation server for building, testing, and deploying software projects.",
  "octopus-deploy-description": "A deployment automation tool designed to simplify software release management.",
  "vsts-description": "Azure DevOps (formerly VSTS), a cloud-based service for managing CI/CD pipelines and projects.",
  "agile-description": "A methodology that promotes adaptive planning, iterative development, and continuous improvement in software projects.",
  "confluence-description": "A team collaboration tool by Atlassian for documentation, knowledge sharing, and project management.",
  "jira-description": "A popular issue and project tracking tool used for Agile software development and team collaboration.",
  "trello-description": "A visual project management tool that helps teams organize tasks using boards, lists, and cards.",
  "cms-networking": "CMS, Analysis and Social Networking",
  "cms-networking-description": "The software and platforms for analysis, social networking, and content management workflows.",
  "google-analytics-description": "A web analytics service by Google that tracks and reports website traffic and user behavior.",
  "joomla-description": "A flexible and open-source content management system (CMS) for building websites and applications.",
  "mailchimp-description": "A marketing automation platform and email marketing service for businesses of all sizes.",
  "meta-line-logo-description": "Meta's suite of platforms, including Facebook and Instagram, for social networking and advertising.",
  "shopify-description": "An e-commerce platform that enables businesses to create and manage online stores.",
  "wordpress-description": "A popular content management system (CMS) for building and managing websites and blogs.",
  "tools": "Productivity Tools",
  "tools-description": "Productivty software and platforms for content generation and collaborations.",
  "apple-mac-description": "Apple's ecosystem of macOS-powered devices, widely used for development and design.",
  "brand-github-copilot-description": "An AI-powered coding assistant that helps developers write and complete code faster.",
  "file-type-vba-description": "Visual Basic for Applications, a scripting language for automating tasks in Microsoft Office.",
  "ms-excel-description": "A powerful spreadsheet tool by Microsoft for data analysis, visualization, and automation.",
  "ms-outlook-description": "A Microsoft email client that integrates calendar, tasks, and contact management.",
  "ms-powerpoint-description": "A presentation software by Microsoft, used for creating slideshows and visual content.",
  "ms-word-description": "A word processing application by Microsoft for document creation, editing, and collaboration.",
  "openai-description": "A conversational AI model that assists users in generating text-based responses and content.",
  "google-drive-description": "A cloud storage and file synchronization service by Google, offering productivity tools and collaboration features.",
  "open-journal-systems-description": "An open-source platform for managing and publishing scholarly journals and academic research.",
  "google-pagespeed-insights-description": "A tool that analyzes web page performance and provides suggestions for optimization.",
  "education-languages": "Education & Languages",
  "education-languages-intro": "Formal education, certifications, and language skills.",
  "education": "Education",
  "computer-science": "Computer Science",
  "bologna-university": "University of Bologna",
  "diploma": "Diploma of Commercial Technical Expert",
  "high-school": "\"Caduti della Direttissima\" High School of Castiglione dei Pepoli (BO)",
  "languages": "Languages",
  "italian": "Italian",
  "native-language": "Native language",
  "english": "English",
  "reading-ability": "Reading ablity",
  "writing-ability": "Writing ability",
  "oral-ability": "Oral expression ability"
}
