{
  "getCV": "CV",
  "intro": "Ciao, sono appassionato di software e web design, mi piace creare strumenti che rendono più facile la vita delle persone. Sono uno sviluppatore con un forte focus sul design e oltre 20 anni di esperienza nelle creazione di soluzioni digitali innovative. Le mie competenze spaziano dallo sviluppo frontend e full-stack, con particolare attenzione alla creazione di interfaccie utente responsive e ad alte prestazioni.",
  "work-experience": "Esperienze lavorative",
  "present": "Presente",
  "read-more": "Maggiori dettagli",
  "deltatre-jobtitle": "Full Stack Developer - Servizi web per lo Sport",
  "deltatre-jobdesc": "Sviluppo e manutenzione di soluzioni per la gestione di Eventi sportivi per UEFA, per le maggiori leghe calcistiche europee, e di altri siti sportivi internazionali.",
  "ynap-jobtitle": "Tech Leader - Frontend Web Developer e-commerce di alta moda internazionali",
  "ynap-jobdesc": "Sviluppo e manutenzione di e-commerce per dunhill.com e maison-alaia.com. Sviluppo di pagine e interfaccie utente responsive e cross-browser, miglioramento delle web performance in partnership con Google.",
  "euris-jobtitle": "Frontend Web Developer e-commerce di alta moda internazionali",
  "euris-jobdesc": "Sviluppo e manutenzione di e-commerce per chloe.com, lanvin.com e dunhill.com. Sviluppo di pagine e interfaccie utente responsive e cross-browser.",
  "mw-jobtitle": "Freelance Web Developer",
  "mw-jobdesc": "Sviluppo e manutenzione di siti web e portali. Sviluppo con CMS come Wordpress e Joomla e di soluzioni personalizzate in PHP and Javascript. Ottimizzazioni SEO on-site, Web Marketing e Social Marketing. Configurazioni e manutenzioni di soluzioni di Hosting.",
  "cedac-jobtitle": "Sviluppatore Java junior",
  "cedac-jobdesc": "Sviluppo in Java, XML, XSL, HTML, CSS e Javascript per applicazioni di Home Banking CBI.",
  "demsoft-jobtitle": "UX Developer e Game Designer",
  "demsoft-jobdesc": "Sviluppo e realizzazione di PC Basket 2002 and PC Basket 2003",
  "brands": "Brand",
  "brands-intro": "I maggiori brand con cui ho collaborato",
  "skills": "Skill Tecniche",
  "skills-intro": "Un full stack developer deve padroneggiare una vasta gamma di tecnologie e strumenti per integrare perfettamente le funzionalità front-end e back-end, garantendo soluzioni efficienti e robuste. Questa ampia competenza consente anche di adattarsi rapidamente ai requisiti in continua evoluzione del progetto e di risolvere efficacemente problemi complessi.",
  "frontend-base": "Frontend",
  "frontend-base-description": "Le tecnologie di base per lo sviluppo frontend di pagine e applicazioni web.",
  "html5-description": "Il linguaggio di markup standard per la creazione di pagine e applicazioni web.",
  "css-3-description": "Il linguaggio a Fogli di stile usato per descrivere la presentazione di un documento scritto in HTML.",
  "chrome-devtools-description": "Un set di strumenti per lo sviluppo e il debug integrati direttamente nell'engine del browser. Questi strumenti consento l'ispezione, il debug e l'ottimizzazioni delle performance delle applicazioni web.",
  "responsive-design-description": "Un approccio progettuale che assicura il corretto rendering delle pagine web su vari dispositivi e dimensioni di schermo.",
  "pixel-perfect-description": "Una metodologia che punta all’allineamento preciso di ogni elemento, in modo che il layout finale corrisponda esattamente al mockup previsto.",
  "w3c-description": "Standard e linee guida del World Wide Web Consortium per garantire accessibilità, coerenza e compatibilità nel web.",
  "http-description": "Il protocollo base per lo scambio di dati sul web, che abilita la comunicazione tra client e server.",
  "web-dev-description": "Una piattaforma di Google con linee guida, metriche e best practice per creare siti veloci, sicuri e incentrati sull’utente.",
  "bootstrap-description": "Un toolkit front-end che offre layout reattivi, componenti predefiniti e opzioni di stile per facilitare lo sviluppo web.",
  "sass-description": "Un preprocessore CSS che introduce variabili, nesting e mixin, semplificando e strutturando la scrittura degli stili.",
  "tailwind-css-description": "Un framework CSS di tipo utility-first che mette a disposizione classi pronte all’uso, per uno sviluppo dell’interfaccia rapido e coerente.",
  "design-uxui": "Design & UX/UI",
  "design-uxui-description": "I principi e gli strumenti per creare esperienze digitali coinvolgenti e user-friendly.",
  "svg-xml-description": "Un formato d’immagine vettoriale basato su XML, ideale per grafiche scalabili di alta qualità.",
  "figma-description": "Uno strumento di design collaborativo per il prototyping in tempo reale e il lavoro di squadra.",
  "invision-description": "Piattaforma di progettazione digitale che offre prototipazione, collaborazione e gestione del flusso di lavoro.",
  "illustrator-description": "Il principale software di grafica vettoriale per la creazione di illustrazioni, loghi e visual scalabili.",
  "photoshop-description": "Un diffuso editor di grafica raster per disegno digitale, fotoritocco e composizioni.",
  "material-ui-description": "Una libreria di componenti che implementa il Material Design di Google per un’interfaccia coerente.",
  "frontend-dev": "Sviluppo Frontend",
  "frontend-dev-description": "Approccio focalizzato sulla creazione di esperienze utente dinamiche, unendo design e codice funzionale per interfacce reattive.",
  "visual-studio-code-description": "Un editor di codice versatile con Git integrato, strumenti di debug e un ampio ecosistema di estensioni.",
  "javascript-js-description": "Il linguaggio di programmazione fondamentale del web, che abilita contenuti dinamici e interattivi.",
  "typescript-icon-description": "Un superset tipizzato di JavaScript che introduce controllo statico e scalabilità nei progetti complessi.",
  "jquery-plain-wordmark-description": "Una libreria che semplifica la manipolazione del DOM, la gestione degli eventi e le richieste AJAX con supporto multi-browser.",
  "nodejs-description": "Un runtime JavaScript lato server progettato per applicazioni di rete veloci e scalabili.",
  "npm-description": "Il gestore di pacchetti predefinito per Node.js, con un vasto archivio di librerie e strumenti di sviluppo.",
  "yarn-original-wordmark-description": "Un gestore di pacchetti Node.js che punta su velocità, sicurezza e gestione efficiente delle dipendenze.",
  "file-type-angular-description": "Un framework basato su TypeScript per lo sviluppo di applicazioni a pagina singola robuste e modulari.",
  "react-description": "Una libreria popolare per creare interfacce basate su componenti, con gestione dello stato in un virtual DOM.",
  "redux-original-description": "Un contenitore di stato predicibile che centralizza il flusso dei dati, spesso associato alle applicazioni React.",
  "file-type-jest-description": "Un framework di test che semplifica i test unitari, le snapshot e l’integrazione in JavaScript.",
  "google-maps-description": "Un’API che integra mappe interattive, geocodifica e servizi di localizzazione nelle applicazioni web.",
  "mapbox-description": "Una piattaforma di mappe e localizzazione che offre stili personalizzabili, visualizzazione dati e aggiornamenti in tempo reale.",
  "gulp-description": "Un task runner basato su streaming che automatizza i processi di build ripetitivi nello sviluppo front-end.",
  "webpack-original-description": "Un potente module bundler che compila JavaScript, CSS e altri asset in bundle ottimizzati.",
  "electron-description": "Un framework per creare app desktop multipiattaforma usando JavaScript, HTML e CSS.",
  "cloudinary-description": "Un servizio per gestire, trasformare e distribuire immagini e video in modo efficiente.",
  "brand-threejs-description": "Una libreria JavaScript 3D basata su WebGL per creare grafiche interattive e animazioni in tempo reale nel browser.",
  "backend": "Backend",
  "backend-description": "Tecnologie e strumenti per lo sviluppo server-side e la manipolazione dei dati.",
  "visual-studio-description": "Un ambiente di sviluppo integrato di Microsoft per creare, eseguire il debug e distribuire app .NET.",
  "aspdotnet-description": "Un framework per sviluppare app .NET moderne, basate sul cloud e connesse a Internet.",
  "c-sharp-c-description": "Un linguaggio orientato agli oggetti di Microsoft, progettato per soluzioni .NET efficienti.",
  "php-description": "Un linguaggio di scripting lato server molto diffuso, alla base di siti web e piattaforme CMS.",
  "python-description": "Un linguaggio di alto livello noto per la semplicità della sintassi e un vasto ecosistema.",
  "gnome-fs-ftp-description": "Un protocollo di rete standard per il trasferimento di file tra client e server.",
  "ssh-description": "Un protocollo crittografico che garantisce connessioni remote sicure e scambio di dati protetto.",
  "file-type-rest-description": "Un’architettura stateless focalizzata su prestazioni e scalabilità per i servizi web moderni.",
  "swagger-description": "Un insieme di strumenti per documentare e testare le API REST con interfacce leggibili e interattive.",
  "apache-original-wordmark-description": "Un server HTTP open-source, robusto e ampiamente adottato per siti e applicazioni web.",
  "file-type-firebase-description": "Piattaforma di Google che offre database in tempo reale, autenticazione e hosting di applicazioni.",
  "google-cloud-description": "Una suite di servizi cloud per archiviazione scalabile, analisi dei dati e distribuzione di app.",
  "aws-description": "La piattaforma on-demand di Amazon che fornisce calcolo, storage, database e molto altro.",
  "sonarqube-description": "Strumento di analisi continua del codice che valuta la qualità, la sicurezza e la manutenibilità.",
  "databases": "Database",
  "database-description": "Archiviazione e  gestione dei dati, garantendo coerenza, sicurezza e query efficienti.",
  "mysql-original-wordmark-description": "Un diffuso database relazionale open-source, apprezzato per velocità, affidabilità e facilità d’uso.",
  "postgresql-plain-wordmark-description": "Un database open-source avanzato che offre elevata integrità dei dati e conformità SQL.",
  "file-type-access-description": "Uno strumento Microsoft per creare e gestire applicazioni desktop basate sui dati.",
  "firestore-description": "Un database NoSQL flessibile e scalabile di Google Cloud, per salvare e sincronizzare dati su tutti i dispositivi.",
  "mongodb-original-wordmark-description": "Un database NoSQL orientato ai documenti, con alta scalabilità e flessibilità.",
  "graphql-description": "Un linguaggio di query per API che abilita un recupero dati mirato, riducendo il sovraccarico.",
  "xml-document-description": "Un linguaggio di markup pensato per archiviare e trasportare dati in modo strutturato e leggibile dalle macchine.",
  "application-xslt-xml-description": "Un linguaggio per trasformare documenti XML in diversi formati, rendendo possibile la generazione dinamica di contenuti.",
  "cicd": "CI/CD e Gestione dei Progetti",
  "cicd-description": "Integrazione e distribuzione continua, garantendo consegne software efficienti e automatizzate.",
  "github-description": "Una piattaforma ampiamente utilizzata per il controllo di versione e la collaborazione basata su Git.",
  "bitbucket-description": "Un servizio di hosting per repository Git, pensato per team e aziende.",
  "microsoft-azure-description": "Il servizio di cloud computing di Microsoft, con pipeline CI/CD, hosting e strumenti DevOps.",
  "jenkins-original-description": "Un server di automazione open-source per la compilazione, il test e il deployment di software.",
  "octopus-deploy-description": "Uno strumento di automazione per la gestione semplificata del rilascio del software.",
  "vsts-description": "Azure DevOps (ex VSTS), un servizio cloud per la gestione di pipeline CI/CD e progetti.",
  "agile-description": "Una metodologia che promuove la pianificazione adattiva, lo sviluppo iterativo e il miglioramento continuo nei progetti software.",
  "confluence-description": "Uno strumento di collaborazione di Atlassian per documentazione, condivisione della conoscenza e gestione dei progetti.",
  "jira-description": "Un popolare strumento di gestione delle attività e dei progetti, utilizzato nello sviluppo Agile e nella collaborazione di squadra.",
  "trello-description": "Uno strumento di gestione visiva dei progetti che aiuta i team a organizzare le attività con board, liste e schede.",
  "cms-networking": "CMS, Analisi e Social Networking",
  "cms-networking-description": "Software e piattaforme per l'analisi del traffico, il social networking, e la gestione dei contenuti.",
  "google-analytics-description": "Un servizio di analisi web di Google per monitorare il traffico e il comportamento degli utenti sui siti.",
  "joomla-description": "Un CMS open-source flessibile per la creazione e gestione di siti web e applicazioni.",
  "mailchimp-description": "Una piattaforma di automazione del marketing e servizio di email marketing per aziende di ogni dimensione.",
  "meta-line-logo-description": "La suite di piattaforme di Meta, tra cui Facebook e Instagram, per social networking e pubblicità.",
  "wordpress-description": "Un CMS popolare per la creazione e gestione di siti web e blog.",
  "openai-description": "Un modello AI conversazionale che aiuta gli utenti a generare risposte e contenuti testuali.",
  "tools": "Strumenti per la produttività e CMS",
  "tools-description": "Software e piattaforme per la produttività, la collaborazione e la gestione dei contenuti.",
  "apple-mac-description": "L'ecosistema Apple con dispositivi basati su macOS, ampiamente utilizzato per sviluppo e design.",
  "brand-github-copilot-description": "Un assistente AI per il coding che aiuta gli sviluppatori a scrivere e completare il codice più velocemente.",
  "file-type-vba-description": "Visual Basic for Applications, un linguaggio di scripting per automatizzare attività in Microsoft Office.",
  "ms-excel-description": "Un potente strumento di fogli di calcolo di Microsoft per analisi, visualizzazione e automazione dei dati.",
  "ms-outlook-description": "Un client email di Microsoft che integra calendario, gestione attività e contatti.",
  "ms-powerpoint-description": "Un software per presentazioni di Microsoft, usato per creare slideshow e contenuti visivi.",
  "ms-word-description": "Un'applicazione di elaborazione testi di Microsoft per la creazione, modifica e collaborazione su documenti.",
  "shopify-description": "Una piattaforma di e-commerce che permette alle aziende di creare e gestire negozi online.",
  "google-drive-description": "Servizio di archiviazione e sincronizzazione di documenti online offerto da Google, con strumenti utili per produttività e la collaborazione.",
  "open-journal-systems-description": "Una piattaforma open-source per la gestione e pubblicazione di journal e ricerche accademiche.",
  "google-pagespeed-insights-description": "Uno strumento che analizza le performance di pagine web e fornisce suggerimenti per la loro ottimizzazione.",
  "education-languages": "Formazione e Lingue",
  "education-languages-intro": "Studi e competenze linguistiche.",
  "education": "Educazione",
  "computer-science": "Informatica",
  "bologna-university": "Università di Bologna",
  "diploma": "Diploma di Tecnico Commerciale",
  "high-school": "Istituto superiore \"Caduti della Direttissima\" - Castiglione dei Pepoli (BO)",
  "languages": "Lingue",
  "italian": "Italiano",
  "native-language": "Madrelingua",
  "english": "Inglese",
  "reading-ability": "lettura",
  "writing-ability": "scrittura",
  "oral-ability": "parlato",
  "free-time": "Tempo libero",
  "free-time-intro": "Personal interests and activities.",
  "trekking": "Trekking e attività all'aperto",
  "trekking-intro": "Nel mio tempo libero adoro fare passeggiate e trekking immerso nella bellezza dei parchi naturali vicino a casa.",
  "maps-intro": "Di seguito uno dei giri più belli proprio attorno al mio paese 💚",
  "associationism": "Associazionismo e promozione del territorio",
  "associationism-intro": "Dal 2012 assieme ad un gruppo di amici gestico l'Associazione Culturale Officina15 APS, circolo ARCI giovanile che ha come obiettivi quelli di promuovere  e rivalutare il territorio dell’Alto Appennino Bolognese, facendo da punto di riferimento e di aggregazione per chi voglia sviluppare le proprie idee artistiche e creative, con un interesse particolare ai nuovi media e alle forme di espressione contemporanee."
}
